analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/dma_regs.h
#define MXC_F_DMA_CTRL_RLDEN_POS                       1 /**< CTRL_RLDEN Position */
#define MXC_F_DMA_CTRL_RLDEN                           ((uint32_t)(0x1UL << MXC_F_DMA_CTRL_RLDEN_POS)) /**< CTRL_RLDEN Mask */

#define MXC_F_DMA_CTRL_PRI_POS                         2 /**< CTRL_PRI Position */
#define MXC_F_DMA_CTRL_PRI                             ((uint32_t)(0x3UL << MXC_F_DMA_CTRL_PRI_POS)) /**< CTRL_PRI Mask */
#define MXC_V_DMA_CTRL_PRI_HIGH                        ((uint32_t)0x0UL) /**< CTRL_PRI_HIGH Value */
#define MXC_S_DMA_CTRL_PRI_HIGH                        (MXC_V_DMA_CTRL_PRI_HIGH << MXC_F_DMA_CTRL_PRI_POS) /**< CTRL_PRI_HIGH Setting */
#define MXC_V_DMA_CTRL_PRI_MEDHIGH                     ((uint32_t)0x1UL) /**< CTRL_PRI_MEDHIGH Value */
#define MXC_S_DMA_CTRL_PRI_MEDHIGH                     (MXC_V_DMA_CTRL_PRI_MEDHIGH << MXC_F_DMA_CTRL_PRI_POS) /**< CTRL_PRI_MEDHIGH Setting */
#define MXC_V_DMA_CTRL_PRI_MEDLOW                      ((uint32_t)0x2UL) /**< CTRL_PRI_MEDLOW Value */
#define MXC_S_DMA_CTRL_PRI_MEDLOW                      (MXC_V_DMA_CTRL_PRI_MEDLOW << MXC_F_DMA_CTRL_PRI_POS) /**< CTRL_PRI_MEDLOW Setting */
#define MXC_V_DMA_CTRL_PRI_LOW                         ((uint32_t)0x3UL) /**< CTRL_PRI_LOW Value */
#define MXC_S_DMA_CTRL_PRI_LOW                         (MXC_V_DMA_CTRL_PRI_LOW << MXC_F_DMA_CTRL_PRI_POS) /**< CTRL_PRI_LOW Setting */

#define MXC_F_DMA_CTRL_REQUEST_POS                     4 /**< CTRL_REQUEST Position */
#define MXC_F_DMA_CTRL_REQUEST                         ((uint32_t)(0x3FUL << MXC_F_DMA_CTRL_REQUEST_POS)) /**< CTRL_REQUEST Mask */
#define MXC_V_DMA_CTRL_REQUEST_MEMTOMEM                ((uint32_t)0x0UL) /**< CTRL_REQUEST_MEMTOMEM Value */
#define MXC_S_DMA_CTRL_REQUEST_MEMTOMEM                (MXC_V_DMA_CTRL_REQUEST_MEMTOMEM << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_MEMTOMEM Setting */
#define MXC_V_DMA_CTRL_REQUEST_SPI0RX                  ((uint32_t)0x1UL) /**< CTRL_REQUEST_SPI0RX Value */
#define MXC_S_DMA_CTRL_REQUEST_SPI0RX                  (MXC_V_DMA_CTRL_REQUEST_SPI0RX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI0RX Setting */
#define MXC_V_DMA_CTRL_REQUEST_SPI1RX                  ((uint32_t)0x2UL) /**< CTRL_REQUEST_SPI1RX Value */
#define MXC_S_DMA_CTRL_REQUEST_SPI1RX                  (MXC_V_DMA_CTRL_REQUEST_SPI1RX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI1RX Setting */
#define MXC_V_DMA_CTRL_REQUEST_SPI2RX                  ((uint32_t)0x3UL) /**< CTRL_REQUEST_SPI2RX Value */
#define MXC_S_DMA_CTRL_REQUEST_SPI2RX                  (MXC_V_DMA_CTRL_REQUEST_SPI2RX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI2RX Setting */
#define MXC_V_DMA_CTRL_REQUEST_UART0RX                 ((uint32_t)0x4UL) /**< CTRL_REQUEST_UART0RX Value */
#define MXC_S_DMA_CTRL_REQUEST_UART0RX                 (MXC_V_DMA_CTRL_REQUEST_UART0RX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_UART0RX Setting */
#define MXC_V_DMA_CTRL_REQUEST_UART1RX                 ((uint32_t)0x5UL) /**< CTRL_REQUEST_UART1RX Value */
#define MXC_S_DMA_CTRL_REQUEST_UART1RX                 (MXC_V_DMA_CTRL_REQUEST_UART1RX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_UART1RX Setting */
#define MXC_V_DMA_CTRL_REQUEST_CAN0RX                  ((uint32_t)0x6UL) /**< CTRL_REQUEST_CAN0RX Value */
#define MXC_S_DMA_CTRL_REQUEST_CAN0RX                  (MXC_V_DMA_CTRL_REQUEST_CAN0RX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_CAN0RX Setting */
#define MXC_V_DMA_CTRL_REQUEST_I2C0RX                  ((uint32_t)0x7UL) /**< CTRL_REQUEST_I2C0RX Value */
#define MXC_S_DMA_CTRL_REQUEST_I2C0RX                  (MXC_V_DMA_CTRL_REQUEST_I2C0RX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_I2C0RX Setting */
#define MXC_V_DMA_CTRL_REQUEST_I2C1RX                  ((uint32_t)0x8UL) /**< CTRL_REQUEST_I2C1RX Value */
#define MXC_S_DMA_CTRL_REQUEST_I2C1RX                  (MXC_V_DMA_CTRL_REQUEST_I2C1RX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_I2C1RX Setting */
#define MXC_V_DMA_CTRL_REQUEST_ADC                     ((uint32_t)0x9UL) /**< CTRL_REQUEST_ADC Value */
#define MXC_S_DMA_CTRL_REQUEST_ADC                     (MXC_V_DMA_CTRL_REQUEST_ADC << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_ADC Setting */
#define MXC_V_DMA_CTRL_REQUEST_I2C2RX                  ((uint32_t)0xAUL) /**< CTRL_REQUEST_I2C2RX Value */
#define MXC_S_DMA_CTRL_REQUEST_I2C2RX                  (MXC_V_DMA_CTRL_REQUEST_I2C2RX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_I2C2RX Setting */
#define MXC_V_DMA_CTRL_REQUEST_UART2RX                 ((uint32_t)0xEUL) /**< CTRL_REQUEST_UART2RX Value */
#define MXC_S_DMA_CTRL_REQUEST_UART2RX                 (MXC_V_DMA_CTRL_REQUEST_UART2RX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_UART2RX Setting */
#define MXC_V_DMA_CTRL_REQUEST_SPI3RX                  ((uint32_t)0xFUL) /**< CTRL_REQUEST_SPI3RX Value */
#define MXC_S_DMA_CTRL_REQUEST_SPI3RX                  (MXC_V_DMA_CTRL_REQUEST_SPI3RX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI3RX Setting */
#define MXC_V_DMA_CTRL_REQUEST_SPI4RX                  ((uint32_t)0x10UL) /**< CTRL_REQUEST_SPI4RX Value */
#define MXC_S_DMA_CTRL_REQUEST_SPI4RX                  (MXC_V_DMA_CTRL_REQUEST_SPI4RX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI4RX Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBRX1                  ((uint32_t)0x11UL) /**< CTRL_REQUEST_USBRX1 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBRX1                  (MXC_V_DMA_CTRL_REQUEST_USBRX1 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRX1 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBRX2                  ((uint32_t)0x12UL) /**< CTRL_REQUEST_USBRX2 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBRX2                  (MXC_V_DMA_CTRL_REQUEST_USBRX2 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRX2 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBRX3                  ((uint32_t)0x13UL) /**< CTRL_REQUEST_USBRX3 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBRX3                  (MXC_V_DMA_CTRL_REQUEST_USBRX3 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRX3 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBRX4                  ((uint32_t)0x14UL) /**< CTRL_REQUEST_USBRX4 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBRX4                  (MXC_V_DMA_CTRL_REQUEST_USBRX4 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRX4 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBRX5                  ((uint32_t)0x15UL) /**< CTRL_REQUEST_USBRX5 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBRX5                  (MXC_V_DMA_CTRL_REQUEST_USBRX5 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRX5 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBRX6                  ((uint32_t)0x16UL) /**< CTRL_REQUEST_USBRX6 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBRX6                  (MXC_V_DMA_CTRL_REQUEST_USBRX6 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRX6 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBRX7                  ((uint32_t)0x17UL) /**< CTRL_REQUEST_USBRX7 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBRX7                  (MXC_V_DMA_CTRL_REQUEST_USBRX7 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRX7 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBRX8                  ((uint32_t)0x18UL) /**< CTRL_REQUEST_USBRX8 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBRX8                  (MXC_V_DMA_CTRL_REQUEST_USBRX8 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRX8 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBRX9                  ((uint32_t)0x19UL) /**< CTRL_REQUEST_USBRX9 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBRX9                  (MXC_V_DMA_CTRL_REQUEST_USBRX9 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRX9 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBRX10                 ((uint32_t)0x1AUL) /**< CTRL_REQUEST_USBRX10 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBRX10                 (MXC_V_DMA_CTRL_REQUEST_USBRX10 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRX10 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBRX11                 ((uint32_t)0x1BUL) /**< CTRL_REQUEST_USBRX11 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBRX11                 (MXC_V_DMA_CTRL_REQUEST_USBRX11 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRX11 Setting */
#define MXC_V_DMA_CTRL_REQUEST_UART3RX                 ((uint32_t)0x1CUL) /**< CTRL_REQUEST_UART3RX Value */
#define MXC_S_DMA_CTRL_REQUEST_UART3RX                 (MXC_V_DMA_CTRL_REQUEST_UART3RX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_UART3RX Setting */
#define MXC_V_DMA_CTRL_REQUEST_I2SRX                   ((uint32_t)0x1EUL) /**< CTRL_REQUEST_I2SRX Value */
#define MXC_S_DMA_CTRL_REQUEST_I2SRX                   (MXC_V_DMA_CTRL_REQUEST_I2SRX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_I2SRX Setting */
#define MXC_V_DMA_CTRL_REQUEST_CAN1RX                  ((uint32_t)0x1FUL) /**< CTRL_REQUEST_CAN1RX Value */
#define MXC_S_DMA_CTRL_REQUEST_CAN1RX                  (MXC_V_DMA_CTRL_REQUEST_CAN1RX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_CAN1RX Setting */
#define MXC_V_DMA_CTRL_REQUEST_SPI0TX                  ((uint32_t)0x21UL) /**< CTRL_REQUEST_SPI0TX Value */
#define MXC_S_DMA_CTRL_REQUEST_SPI0TX                  (MXC_V_DMA_CTRL_REQUEST_SPI0TX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI0TX Setting */
#define MXC_V_DMA_CTRL_REQUEST_SPI1TX                  ((uint32_t)0x22UL) /**< CTRL_REQUEST_SPI1TX Value */
#define MXC_S_DMA_CTRL_REQUEST_SPI1TX                  (MXC_V_DMA_CTRL_REQUEST_SPI1TX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI1TX Setting */
#define MXC_V_DMA_CTRL_REQUEST_SPI2TX                  ((uint32_t)0x23UL) /**< CTRL_REQUEST_SPI2TX Value */
#define MXC_S_DMA_CTRL_REQUEST_SPI2TX                  (MXC_V_DMA_CTRL_REQUEST_SPI2TX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI2TX Setting */
#define MXC_V_DMA_CTRL_REQUEST_UART0TX                 ((uint32_t)0x24UL) /**< CTRL_REQUEST_UART0TX Value */
#define MXC_S_DMA_CTRL_REQUEST_UART0TX                 (MXC_V_DMA_CTRL_REQUEST_UART0TX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_UART0TX Setting */
#define MXC_V_DMA_CTRL_REQUEST_UART1TX                 ((uint32_t)0x25UL) /**< CTRL_REQUEST_UART1TX Value */
#define MXC_S_DMA_CTRL_REQUEST_UART1TX                 (MXC_V_DMA_CTRL_REQUEST_UART1TX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_UART1TX Setting */
#define MXC_V_DMA_CTRL_REQUEST_CAN0TX                  ((uint32_t)0x26UL) /**< CTRL_REQUEST_CAN0TX Value */
#define MXC_S_DMA_CTRL_REQUEST_CAN0TX                  (MXC_V_DMA_CTRL_REQUEST_CAN0TX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_CAN0TX Setting */
#define MXC_V_DMA_CTRL_REQUEST_I2C0TX                  ((uint32_t)0x27UL) /**< CTRL_REQUEST_I2C0TX Value */
#define MXC_S_DMA_CTRL_REQUEST_I2C0TX                  (MXC_V_DMA_CTRL_REQUEST_I2C0TX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_I2C0TX Setting */
#define MXC_V_DMA_CTRL_REQUEST_I2C1TX                  ((uint32_t)0x28UL) /**< CTRL_REQUEST_I2C1TX Value */
#define MXC_S_DMA_CTRL_REQUEST_I2C1TX                  (MXC_V_DMA_CTRL_REQUEST_I2C1TX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_I2C1TX Setting */
#define MXC_V_DMA_CTRL_REQUEST_I2C2TX                  ((uint32_t)0x2AUL) /**< CTRL_REQUEST_I2C2TX Value */
#define MXC_S_DMA_CTRL_REQUEST_I2C2TX                  (MXC_V_DMA_CTRL_REQUEST_I2C2TX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_I2C2TX Setting */
#define MXC_V_DMA_CTRL_REQUEST_UART2TX                 ((uint32_t)0x2EUL) /**< CTRL_REQUEST_UART2TX Value */
#define MXC_S_DMA_CTRL_REQUEST_UART2TX                 (MXC_V_DMA_CTRL_REQUEST_UART2TX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_UART2TX Setting */
#define MXC_V_DMA_CTRL_REQUEST_SPI3TX                  ((uint32_t)0x2FUL) /**< CTRL_REQUEST_SPI3TX Value */
#define MXC_S_DMA_CTRL_REQUEST_SPI3TX                  (MXC_V_DMA_CTRL_REQUEST_SPI3TX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI3TX Setting */
#define MXC_V_DMA_CTRL_REQUEST_SPI4TX                  ((uint32_t)0x30UL) /**< CTRL_REQUEST_SPI4TX Value */
#define MXC_S_DMA_CTRL_REQUEST_SPI4TX                  (MXC_V_DMA_CTRL_REQUEST_SPI4TX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI4TX Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBTX1                  ((uint32_t)0x31UL) /**< CTRL_REQUEST_USBTX1 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBTX1                  (MXC_V_DMA_CTRL_REQUEST_USBTX1 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTX1 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBTX2                  ((uint32_t)0x32UL) /**< CTRL_REQUEST_USBTX2 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBTX2                  (MXC_V_DMA_CTRL_REQUEST_USBTX2 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTX2 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBTX3                  ((uint32_t)0x33UL) /**< CTRL_REQUEST_USBTX3 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBTX3                  (MXC_V_DMA_CTRL_REQUEST_USBTX3 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTX3 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBTX4                  ((uint32_t)0x34UL) /**< CTRL_REQUEST_USBTX4 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBTX4                  (MXC_V_DMA_CTRL_REQUEST_USBTX4 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTX4 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBTX5                  ((uint32_t)0x35UL) /**< CTRL_REQUEST_USBTX5 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBTX5                  (MXC_V_DMA_CTRL_REQUEST_USBTX5 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTX5 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBTX6                  ((uint32_t)0x36UL) /**< CTRL_REQUEST_USBTX6 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBTX6                  (MXC_V_DMA_CTRL_REQUEST_USBTX6 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTX6 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBTX7                  ((uint32_t)0x37UL) /**< CTRL_REQUEST_USBTX7 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBTX7                  (MXC_V_DMA_CTRL_REQUEST_USBTX7 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTX7 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBTX8                  ((uint32_t)0x38UL) /**< CTRL_REQUEST_USBTX8 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBTX8                  (MXC_V_DMA_CTRL_REQUEST_USBTX8 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTX8 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBTX9                  ((uint32_t)0x39UL) /**< CTRL_REQUEST_USBTX9 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBTX9                  (MXC_V_DMA_CTRL_REQUEST_USBTX9 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTX9 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBTX10                 ((uint32_t)0x3AUL) /**< CTRL_REQUEST_USBTX10 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBTX10                 (MXC_V_DMA_CTRL_REQUEST_USBTX10 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTX10 Setting */
#define MXC_V_DMA_CTRL_REQUEST_USBTX11                 ((uint32_t)0x3BUL) /**< CTRL_REQUEST_USBTX11 Value */
#define MXC_S_DMA_CTRL_REQUEST_USBTX11                 (MXC_V_DMA_CTRL_REQUEST_USBTX11 << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTX11 Setting */
#define MXC_V_DMA_CTRL_REQUEST_UART3TX                 ((uint32_t)0x3CUL) /**< CTRL_REQUEST_UART3TX Value */
#define MXC_S_DMA_CTRL_REQUEST_UART3TX                 (MXC_V_DMA_CTRL_REQUEST_UART3TX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_UART3TX Setting */
#define MXC_V_DMA_CTRL_REQUEST_I2STX                   ((uint32_t)0x3EUL) /**< CTRL_REQUEST_I2STX Value */
#define MXC_S_DMA_CTRL_REQUEST_I2STX                   (MXC_V_DMA_CTRL_REQUEST_I2STX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_I2STX Setting */
#define MXC_V_DMA_CTRL_REQUEST_CAN1TX                  ((uint32_t)0x3FUL) /**< CTRL_REQUEST_CAN1TX Value */
#define MXC_S_DMA_CTRL_REQUEST_CAN1TX                  (MXC_V_DMA_CTRL_REQUEST_CAN1TX << MXC_F_DMA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_CAN1TX Setting */

#define MXC_F_DMA_CTRL_TO_WAIT_POS                     10 /**< CTRL_TO_WAIT Position */
#define MXC_F_DMA_CTRL_TO_WAIT                         ((uint32_t)(0x1UL << MXC_F_DMA_CTRL_TO_WAIT_POS)) /**< CTRL_TO_WAIT Mask */

#define MXC_F_DMA_CTRL_TO_PER_POS                      11 /**< CTRL_TO_PER Position */
#define MXC_F_DMA_CTRL_TO_PER                          ((uint32_t)(0x7UL << MXC_F_DMA_CTRL_TO_PER_POS)) /**< CTRL_TO_PER Mask */
#define MXC_V_DMA_CTRL_TO_PER_TO4                      ((uint32_t)0x0UL) /**< CTRL_TO_PER_TO4 Value */
#define MXC_S_DMA_CTRL_TO_PER_TO4                      (MXC_V_DMA_CTRL_TO_PER_TO4 << MXC_F_DMA_CTRL_TO_PER_POS) /**< CTRL_TO_PER_TO4 Setting */
#define MXC_V_DMA_CTRL_TO_PER_TO8                      ((uint32_t)0x1UL) /**< CTRL_TO_PER_TO8 Value */
#define MXC_S_DMA_CTRL_TO_PER_TO8                      (MXC_V_DMA_CTRL_TO_PER_TO8 << MXC_F_DMA_CTRL_TO_PER_POS) /**< CTRL_TO_PER_TO8 Setting */
#define MXC_V_DMA_CTRL_TO_PER_TO16                     ((uint32_t)0x2UL) /**< CTRL_TO_PER_TO16 Value */
#define MXC_S_DMA_CTRL_TO_PER_TO16                     (MXC_V_DMA_CTRL_TO_PER_TO16 << MXC_F_DMA_CTRL_TO_PER_POS) /**< CTRL_TO_PER_TO16 Setting */
#define MXC_V_DMA_CTRL_TO_PER_TO32                     ((uint32_t)0x3UL) /**< CTRL_TO_PER_TO32 Value */
#define MXC_S_DMA_CTRL_TO_PER_TO32                     (MXC_V_DMA_CTRL_TO_PER_TO32 << MXC_F_DMA_CTRL_TO_PER_POS) /**< CTRL_TO_PER_TO32 Setting */
#define MXC_V_DMA_CTRL_TO_PER_TO64                     ((uint32_t)0x4UL) /**< CTRL_TO_PER_TO64 Value */
#define MXC_S_DMA_CTRL_TO_PER_TO64                     (MXC_V_DMA_CTRL_TO_PER_TO64 << MXC_F_DMA_CTRL_TO_PER_POS) /**< CTRL_TO_PER_TO64 Setting */
#define MXC_V_DMA_CTRL_TO_PER_TO128                    ((uint32_t)0x5UL) /**< CTRL_TO_PER_TO128 Value */
#define MXC_S_DMA_CTRL_TO_PER_TO128                    (MXC_V_DMA_CTRL_TO_PER_TO128 << MXC_F_DMA_CTRL_TO_PER_POS) /**< CTRL_TO_PER_TO128 Setting */
#define MXC_V_DMA_CTRL_TO_PER_TO256                    ((uint32_t)0x6UL) /**< CTRL_TO_PER_TO256 Value */
#define MXC_S_DMA_CTRL_TO_PER_TO256                    (MXC_V_DMA_CTRL_TO_PER_TO256 << MXC_F_DMA_CTRL_TO_PER_POS) /**< CTRL_TO_PER_TO256 Setting */
#define MXC_V_DMA_CTRL_TO_PER_TO512                    ((uint32_t)0x7UL) /**< CTRL_TO_PER_TO512 Value */
#define MXC_S_DMA_CTRL_TO_PER_TO512                    (MXC_V_DMA_CTRL_TO_PER_TO512 << MXC_F_DMA_CTRL_TO_PER_POS) /**< CTRL_TO_PER_TO512 Setting */

